#
# Created by 
#   ../bin/Linux-x86_64-O/oasysGui 19.2-p002 on Fri Nov 19 21:09:27 2021
# (C) Mentor Graphics Corporation
#
set_units -time ns -capacitance ff -resistance kohm -power nW -voltage V -current mA
create_clock -period 1 -waveform {0 0.5} -name vsysclk 
create_clock -period 1.5 -waveform {0 0.75} -name sysclk [get_ports clk]
set_false_path -from [get_ports rst]
group_path -name I2R -from [list [get_ports cin] [get_ports en] [get_ports rst] [get_ports clk] [get_ports {B[0]}] [get_ports {B[1]}] [get_ports {B[2]}] [get_ports {B[3]}] [get_ports {B[4]}] [get_ports {B[5]}] [get_ports {B[6]}] [get_ports {B[7]}] [get_ports {B[8]}] [get_ports {B[9]}] [get_ports {B[10]}] [get_ports {B[11]}] [get_ports {B[12]}] [get_ports {B[13]}] [get_ports {B[14]}] [get_ports {B[15]}] [get_ports {A[0]}] [get_ports {A[1]}] [get_ports {A[2]}] [get_ports {A[3]}] [get_ports {A[4]}] [get_ports {A[5]}] [get_ports {A[6]}] [get_ports {A[7]}] [get_ports {A[8]}] [get_ports {A[9]}] [get_ports {A[10]}] [get_ports {A[11]}] [get_ports {A[12]}] [get_ports {A[13]}] [get_ports {A[14]}] [get_ports {A[15]}]]
group_path -name I2O -from [list [get_ports cin] [get_ports en] [get_ports rst] [get_ports clk] [get_ports {B[0]}] [get_ports {B[1]}] [get_ports {B[2]}] [get_ports {B[3]}] [get_ports {B[4]}] [get_ports {B[5]}] [get_ports {B[6]}] [get_ports {B[7]}] [get_ports {B[8]}] [get_ports {B[9]}] [get_ports {B[10]}] [get_ports {B[11]}] [get_ports {B[12]}] [get_ports {B[13]}] [get_ports {B[14]}] [get_ports {B[15]}] [get_ports {A[0]}] [get_ports {A[1]}] [get_ports {A[2]}] [get_ports {A[3]}] [get_ports {A[4]}] [get_ports {A[5]}] [get_ports {A[6]}] [get_ports {A[7]}] [get_ports {A[8]}] [get_ports {A[9]}] [get_ports {A[10]}] [get_ports {A[11]}] [get_ports {A[12]}] [get_ports {A[13]}] [get_ports {A[14]}] [get_ports {A[15]}]]  -to [list [get_ports cout] [get_ports {Sum[0]}] [get_ports {Sum[1]}] [get_ports {Sum[2]}] [get_ports {Sum[3]}] [get_ports {Sum[4]}] [get_ports {Sum[5]}] [get_ports {Sum[6]}] [get_ports {Sum[7]}] [get_ports {Sum[8]}] [get_ports {Sum[9]}] [get_ports {Sum[10]}] [get_ports {Sum[11]}] [get_ports {Sum[12]}] [get_ports {Sum[13]}] [get_ports {Sum[14]}] [get_ports {Sum[15]}]]
group_path -name R2O -to [list [get_ports cout] [get_ports {Sum[0]}] [get_ports {Sum[1]}] [get_ports {Sum[2]}] [get_ports {Sum[3]}] [get_ports {Sum[4]}] [get_ports {Sum[5]}] [get_ports {Sum[6]}] [get_ports {Sum[7]}] [get_ports {Sum[8]}] [get_ports {Sum[9]}] [get_ports {Sum[10]}] [get_ports {Sum[11]}] [get_ports {Sum[12]}] [get_ports {Sum[13]}] [get_ports {Sum[14]}] [get_ports {Sum[15]}]]
set_load 10 [get_ports {Sum[15]}]
set_load 10 [get_ports {Sum[14]}]
set_load 10 [get_ports {Sum[13]}]
set_load 10 [get_ports {Sum[12]}]
set_load 10 [get_ports {Sum[11]}]
set_load 10 [get_ports {Sum[10]}]
set_load 10 [get_ports {Sum[9]}]
set_load 10 [get_ports {Sum[8]}]
set_load 10 [get_ports {Sum[7]}]
set_load 10 [get_ports {Sum[6]}]
set_load 10 [get_ports {Sum[5]}]
set_load 10 [get_ports {Sum[4]}]
set_load 10 [get_ports {Sum[3]}]
set_load 10 [get_ports {Sum[2]}]
set_load 10 [get_ports {Sum[1]}]
set_load 10 [get_ports {Sum[0]}]
set_load 10 [get_ports cout]
set_input_transition 0.1 [get_ports {A[15]}]
set_input_transition 0.1 [get_ports {A[14]}]
set_input_transition 0.1 [get_ports {A[13]}]
set_input_transition 0.1 [get_ports {A[12]}]
set_input_transition 0.1 [get_ports {A[11]}]
set_input_transition 0.1 [get_ports {A[10]}]
set_input_transition 0.1 [get_ports {A[9]}]
set_input_transition 0.1 [get_ports {A[8]}]
set_input_transition 0.1 [get_ports {A[7]}]
set_input_transition 0.1 [get_ports {A[6]}]
set_input_transition 0.1 [get_ports {A[5]}]
set_input_transition 0.1 [get_ports {A[4]}]
set_input_transition 0.1 [get_ports {A[3]}]
set_input_transition 0.1 [get_ports {A[2]}]
set_input_transition 0.1 [get_ports {A[1]}]
set_input_transition 0.1 [get_ports {A[0]}]
set_input_transition 0.1 [get_ports {B[15]}]
set_input_transition 0.1 [get_ports {B[14]}]
set_input_transition 0.1 [get_ports {B[13]}]
set_input_transition 0.1 [get_ports {B[12]}]
set_input_transition 0.1 [get_ports {B[11]}]
set_input_transition 0.1 [get_ports {B[10]}]
set_input_transition 0.1 [get_ports {B[9]}]
set_input_transition 0.1 [get_ports {B[8]}]
set_input_transition 0.1 [get_ports {B[7]}]
set_input_transition 0.1 [get_ports {B[6]}]
set_input_transition 0.1 [get_ports {B[5]}]
set_input_transition 0.1 [get_ports {B[4]}]
set_input_transition 0.1 [get_ports {B[3]}]
set_input_transition 0.1 [get_ports {B[2]}]
set_input_transition 0.1 [get_ports {B[1]}]
set_input_transition 0.1 [get_ports {B[0]}]
set_input_transition 0.1 [get_ports clk]
set_input_transition 0.1 [get_ports rst]
set_input_transition 0.1 [get_ports en]
set_input_transition 0.1 [get_ports cin]
set_input_delay 0.7 [get_ports {A[15]}]
set_input_delay 0.7 [get_ports {A[14]}]
set_input_delay 0.7 [get_ports {A[13]}]
set_input_delay 0.7 [get_ports {A[12]}]
set_input_delay 0.7 [get_ports {A[11]}]
set_input_delay 0.7 [get_ports {A[10]}]
set_input_delay 0.7 [get_ports {A[9]}]
set_input_delay 0.7 [get_ports {A[8]}]
set_input_delay 0.7 [get_ports {A[7]}]
set_input_delay 0.7 [get_ports {A[6]}]
set_input_delay 0.7 [get_ports {A[5]}]
set_input_delay 0.7 [get_ports {A[4]}]
set_input_delay 0.7 [get_ports {A[3]}]
set_input_delay 0.7 [get_ports {A[2]}]
set_input_delay 0.7 [get_ports {A[1]}]
set_input_delay 0.7 [get_ports {A[0]}]
set_input_delay 0.7 [get_ports {B[15]}]
set_input_delay 0.7 [get_ports {B[14]}]
set_input_delay 0.7 [get_ports {B[13]}]
set_input_delay 0.7 [get_ports {B[12]}]
set_input_delay 0.7 [get_ports {B[11]}]
set_input_delay 0.7 [get_ports {B[10]}]
set_input_delay 0.7 [get_ports {B[9]}]
set_input_delay 0.7 [get_ports {B[8]}]
set_input_delay 0.7 [get_ports {B[7]}]
set_input_delay 0.7 [get_ports {B[6]}]
set_input_delay 0.7 [get_ports {B[5]}]
set_input_delay 0.7 [get_ports {B[4]}]
set_input_delay 0.7 [get_ports {B[3]}]
set_input_delay 0.7 [get_ports {B[2]}]
set_input_delay 0.7 [get_ports {B[1]}]
set_input_delay 0.7 [get_ports {B[0]}]
set_input_delay 0.7 [get_ports clk]
set_input_delay 0.7 [get_ports rst]
set_input_delay 0.7 [get_ports en]
set_input_delay 0.7 [get_ports cin]
set_output_delay 0.3 -clock vsysclk [get_ports {Sum[15]}]
set_output_delay 0.3 -clock vsysclk [get_ports {Sum[14]}]
set_output_delay 0.3 -clock vsysclk [get_ports {Sum[13]}]
set_output_delay 0.3 -clock vsysclk [get_ports {Sum[12]}]
set_output_delay 0.3 -clock vsysclk [get_ports {Sum[11]}]
set_output_delay 0.3 -clock vsysclk [get_ports {Sum[10]}]
set_output_delay 0.3 -clock vsysclk [get_ports {Sum[9]}]
set_output_delay 0.3 -clock vsysclk [get_ports {Sum[8]}]
set_output_delay 0.3 -clock vsysclk [get_ports {Sum[7]}]
set_output_delay 0.3 -clock vsysclk [get_ports {Sum[6]}]
set_output_delay 0.3 -clock vsysclk [get_ports {Sum[5]}]
set_output_delay 0.3 -clock vsysclk [get_ports {Sum[4]}]
set_output_delay 0.3 -clock vsysclk [get_ports {Sum[3]}]
set_output_delay 0.3 -clock vsysclk [get_ports {Sum[2]}]
set_output_delay 0.3 -clock vsysclk [get_ports {Sum[1]}]
set_output_delay 0.3 -clock vsysclk [get_ports {Sum[0]}]
set_output_delay 0.3 -clock vsysclk [get_ports cout]
set_operating_conditions  -library  [get_libs {NangateOpenCellLibrary}] -max  typical
